Repository: giellalt/corpus-sme
Catalog: tmx/eng/admin/depts/regjeringen.no/departemeantta-birra_id_591.html.tmx
Source language: sme
Languages: eng

source: Departemeantta birra - regjeringen.no
eng: The Ministry - regjeringen.no

source: Máhttodepartemeanttas (Kunnskapsdepartementet) (KD) lea ovddasvástádus servodatsektoriin mat leat deaŧalaččat midjiide jus galgat stuorrut ja ovdánit – sihke ovttaskas olmmožin ja servodahkan.
eng: The Ministry of Education and Research is responsible for kindergarten, education and research, sectors important to our growth and development – both as individuals and as a society.

source: Mánáidgárddiin, oahpahusásahusain ja dutkanbirrasiin lea seammás deaŧalaš kulturguoddi- ja kulturgaskkusteaddjidoaibma.
eng: At the same time the kindergardens, educational institutions and the research establishments play important roles as cultural agents and purveyors of culture.

source: MD bargá ahte ovdánahttin, rievdan ja nuppastuhttin galgá vázzit giehtalaga árbevieruid ja árvvuid seailluhemiin ja viidáseappot doalvvuhemiin.
eng: Development and change must go hand in hand with conservation and transfer of tradition and values.

source: Norggas galgá leat buorre ja beaktilis oahppovuogádat ja árjjalaš ja hutkkás dutkanbirrasat.
eng: The work of the Ministry is aimed at ensuring that Norway has a sound and well functioning educational system and productive and creative research environments.

source: Mii dárbbašit daid ásahusaid jus mii galgat nágodit deaividit hástalusaiguin máilmmus gos kapitála ja máhttu rastidit rájiid, gos diehtojuohkin- ja bioteknologiija buvttihit ođđa vejolašvuođaid ja ehtalaš hástalusaid, gos máhttu lea deaŧaleamos kapitála.
eng: We need these institutions if we are to meet the challenges in a world where capital and knowledge transcend boundaries, where information technology and biotechnology create new opportunities and ethical challenges, where knowledge is the most important asset.

source: KD ubmil lea ahte buohkain galgá leat vejolašvuohta searvat ja váikkuhit máhttoservodaga ovdáneapmái.
eng: The Ministry seeks to ensure that everyone has the opportunity to participate and influence development in the knowledge society.

source: Vuođđoskuvlaoahppu lea gielddaid ovddasvástádus, ja joatkka oahppu lea fas fylkkagielddaid ovddasvástádus. Stáhtaráđđi lea departemeantta bajemus jođiheaddji.
eng: An important condition for achieving this goal is the existence of a knowledge sector that is able to develop, communicate and exploit new knowledge.

source: Maŋimuš ođasmahttojuvvon: 14.01.2012
eng: Last updated: 14.01.2012
